leetcode_992_subarrays_with_k_different_integers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 992. Subarrays with K Different Integers</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 992. Subarrays with K Different Integers</h1>
<ul class="org-ul">
<li><a href="is_there_an_alternative_problem_easier_to_solve.html#ID-64E7E55B-09A9-4022-AB5E-1D25FC64EAC9">Is there an alternative problem easier to solve?</a>  Compute \(c(x)\) which is the number of arrays with at most \(x\) distinct elements.  The answer for the original problem is \(c(k) - c(k-1)\).  Time and space complexity is \(O(N)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">subarraysWithKDistinct</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>], k: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(nums)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calc</span>(k):
            <span style="font-weight: bold; font-style: italic;">c</span> = [0] * (N + 1)
            <span style="font-weight: bold; font-style: italic;">j</span> = <span style="font-weight: bold; font-style: italic;">d</span> = <span style="font-weight: bold; font-style: italic;">ans</span> = 0
            <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
                c[<span style="font-weight: bold; font-style: italic;">nums</span>[i]] += 1
                <span style="font-weight: bold; font-style: italic;">d</span> += 1 <span style="font-weight: bold;">if</span> c[nums[i]] == 1 <span style="font-weight: bold;">else</span> 0
                <span style="font-weight: bold;">while</span> d &gt; <span style="font-weight: bold; font-style: italic;">k</span>:
                    c[nums[j]] -= 1
                    <span style="font-weight: bold; font-style: italic;">d</span> -= 1 <span style="font-weight: bold;">if</span> c[nums[j]] == 0 <span style="font-weight: bold;">else</span> 0
                    <span style="font-weight: bold; font-style: italic;">j</span> += 1
                <span style="font-weight: bold; font-style: italic;">ans</span> += i - j + 1
            <span style="font-weight: bold;">return</span> ans

        <span style="font-weight: bold;">return</span> calc(k) - calc(k - 1)


<span style="font-weight: bold;">assert</span> Solution().subarraysWithKDistinct([1, 2, 1, 2, 3], 2) == 7
<span style="font-weight: bold;">assert</span> Solution().subarraysWithKDistinct([1, 2, 1, 3, 4], 3) == 3
</pre>
</div>
</div>
</body>
</html>